age(N,`Ще не народився.`):- (2017-N)<0.
age(N,`Немовля`):- (2017-N)>=0,(2017-N)=<3.
age(N,`Дитина`):- (2017-N)>3,(2017-N)=<12.
age(N,`Підліток`):- (2017-N)>12,(2017-N)=<15.
age(N,`Юнак`):- (2017-N)>15,(2017-N)=<26.
age(N,`Чоловік`):- (2017-N)>26,(2017-N)=<70.
age(N,`Старий`):- (2017-N)>70,(2017-N)=<95.
age(N,`Довгожитель`):- (2017-N)>95.

age1(N,"Ще не народився."):- (2017-N)<0.
age1(N,"Немовля"):- (2017-N)>=0,(2017-N)=<3.
age1(N,"Дитина"):- (2017-N)>3,(2017-N)=<12.
age1(N,"Підліток"):- (2017-N)>12,(2017-N)=<15.
age1(N,"Юнак"):- (2017-N)>15,(2017-N)=<26.
age1(N,"Чоловік"):- (2017-N)>26,(2017-N)=<70.
age1(N,"Старий"):- (2017-N)>70,(2017-N)=<95.
age1(N,"Довгожитель"):- (2017-N)>95.
