%сумування чисел з кроком d
sum(D,N,R):- N =< D, R = N,!.%умова завершення рекурсії
sum(D,N,R):- N1 is N-D, sum(D,N1,R1),%рекурсивний виклик із новим значенням
R is N+R1.%накопичення суми
start:- writef("Enter d << "),read(D),%зчитування D
writef("Enter n << "),read(N),%зчитування N
sum(D,N,R),write(R).%виконання функції

%піднесення у степінь
degree(A,0,1):-!.%число у степені 0 дорівнює 1
degree(A,1,A):-!.%число у степені 1 дорівнює самому числу
degree(A,N,R):- N =< 0, N1 is (-N), degree(A,N1,R1), R is 1/R1,!.%якщо степінь від'ємна
degree(A,N,R):- (N mod 2) =:= 0, N1 is N/2, degree(A,N1,R1), R is (R1*R1),!.%рекурсивний вираз для парного ступеня
degree(A,N,R):- N1 is N-1, degree(A,N1,R1), R is A*R1.%звичайний рекусивний виклик

%інтевал від 0 до N
sequsum(X,X,0):-!.%сума від заданого числа до того ж дорівнює 0
sequsum(X,X+1,0):-!.%сума від заданого числа до наступного дорівнює 1
sequsum(X,Y,Z) :- Y > X, X1 is X+1,
sequsum(X1,Y,Z1), Z is X+Z1.%сумуємо значення
calc(X,X,0):-!.
calc(X,Y,Z):- X1 is X+1,sequsum(X1,Y,Z).%рахуємо рекурсивно
